Repository: Alerwann/passwordcreator
Catalog: lib/l10n/app_*.arb
Languages: fr

# choosePasswordType
source: Choose your password type:
fr: Choisi ton type de mot de passe :

# defaultButton
source: Default
fr: Par défaut

# defaultDescription
source: (10 characters with at least 1 uppercase, 1 lowercase, 1 digit, 1 special)
fr: (10 caractères dont au moins 1 majuscule, 1 minuscule, 1 chiffre, 1 spécial)

# customButton
source: Custom
fr: Personnalisé

# minimumValuesLabel
source: Minimum value for each type
fr: Valeur minimum pour chaque type

# totalCharactersLabel
source: Total number of characters
fr: Nombre total de caractères

# specialCharactersLabel
source: Number of special characters
fr: Nombre de caractères spéciaux

# uppercaseLabel
source: Number of uppercase letters
fr: Nombre de majuscules

# lowercaseLabel
source: Number of lowercase letters
fr: Nombre de minuscules

# digitsLabel
source: Number of digits
fr: Nombre de chiffres

# generateButton
source: Generate
fr: Générer

# errorTotalTooLow
source: The total ({total}) must be â‰¥ to the sum of minimums ({sum})
fr: Le total ({total}) doit être ≥ à la somme des minimums ({sum})

# errorMinimumLength
source: The password must contain at least 4 characters
fr: Le mot de passe doit contenir au moins 4 caractères

# errorMaxLength
source: The password must be a maximum of 30 characters long.
fr: Le mot de passe mesure 30 caratère au maximum

# resultTitle
source: Creation
fr: Création

source: Your password:
fr: Ton mot de passe :

# copyButton
source: Copy
fr: Copier

# copiedButton
source: Copied!
fr: Copié !

# regenerateButton
source: Regenerate
fr: Regénérer

# passwordRegenerated
source: New password generated!
fr: Nouveau mot de passe généré !

source: GENERATING...
fr: GÉNÉRATION...
